# Pandas

In [3]:
import numpy as np
import pandas as pd

In [2]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [5]:
df=pd.DataFrame(data)

#### 1. Вывести информацию о датафрейме.

In [6]:
print(df)

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [46]:
df[0:3]

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [45]:
df[['animal','age']]

  animal  age
0    cat  2.5
1    cat  3.0
2  snake  0.5
3    dog  NaN
4    dog  5.0
5    cat  2.0
6  snake  4.5
7    cat  NaN
8    dog  7.0
9    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [44]:
df.iloc[[3,4,8],[0,1]]

  animal  age
3    dog  NaN
4    dog  5.0
8    dog  7.0

#### 5. Выберите строки где количество посещений больше 3.

In [53]:
df[df['visits']>3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [81]:
df[df['age'].isnull()]

  animal  age  visits priority
3    dog  NaN     3.0      yes
7    cat  NaN     1.0      yes

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [83]:
df[(df['animal']=='cat')&(df['age']<3)]

  animal  age  visits priority
0    cat  2.5     1.0      yes
5    cat  1.5     3.0       no

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [84]:
df[(df['age']>=2)&(df['age']<=4)]

  animal  age  visits priority
0    cat  2.5     1.0      yes
1    cat  3.0     3.0      yes
9    dog  3.0     1.0       no

#### 9. Измените возраст в строке 'f' на 1,5.

In [90]:
df.at[5,'age']=1.5
print(df)

  animal  age  visits priority
0    cat  2.5     1.0      yes
1    cat  3.0     3.0      yes
2  snake  0.5     2.0       no
3    dog  NaN     3.0      yes
4    dog  5.0     2.0       no
5    cat  1.5     3.0       no
6  snake  4.5     1.0       no
7    cat  NaN     1.0      yes
8    dog  7.0     2.0       no
9    dog  3.0     1.0       no
f    NaN  1.5     NaN      NaN

#### 10. Рассчитать общее количество всех посещений.

In [87]:
df['visits'].sum()

19.0

#### 11. Расчитайте суммарный возраст животных

In [89]:
df['age'].sum()

28.5

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [116]:
df.loc['k']=['mouse',1.5,1.0,'no']
print(df)
df= df.drop('k')
print(df)

  animal  age  visits priority
0    cat  2.5     1.0      yes
1    cat  3.0     3.0      yes
2  snake  0.5     2.0       no
3    dog  NaN     3.0      yes
4    dog  5.0     2.0       no
5    cat  1.5     3.0       no
6  snake  4.5     1.0       no
7    cat  NaN     1.0      yes
8    dog  7.0     2.0       no
9    dog  3.0     1.0       no
k  mouse  1.5     1.0       no
  animal  age  visits priority
0    cat  2.5     1.0      yes
1    cat  3.0     3.0      yes
2  snake  0.5     2.0       no
3    dog  NaN     3.0      yes
4    dog  5.0     2.0       no
5    cat  1.5     3.0       no
6  snake  4.5     1.0       no
7    cat  NaN     1.0      yes
8    dog  7.0     2.0       no
9    dog  3.0     1.0       no

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [103]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
mouse    1
Name: animal, dtype: int64

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [111]:
df.sort_values(by=['age'], ascending=True)
df.sort_values(by=['visits'], ascending=True)

   animal  age  visits priority
0     cat  2.5     1.0      yes
6   snake  4.5     1.0       no
7     cat  NaN     1.0      yes
9     dog  3.0     1.0       no
10  mouse  1.5     1.0       no
k   mouse  1.5     1.0       no
2   snake  0.5     2.0       no
4     dog  5.0     2.0       no
8     dog  7.0     2.0       no
1     cat  3.0     3.0      yes
3     dog  NaN     3.0      yes
5     cat  1.5     3.0       no
f     NaN  1.5     NaN      NaN

#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [124]:
df1=df[df['priority']=='yes'].replace('yes','no')
df2=df[df['priority']=='no'].replace('no','yes')
df3=pd.concat([df1,df2])
print(df)
print(df3)

  animal  age  visits priority
0    cat  2.5     1.0      yes
1    cat  3.0     3.0      yes
2  snake  0.5     2.0       no
3    dog  NaN     3.0      yes
4    dog  5.0     2.0       no
5    cat  1.5     3.0       no
6  snake  4.5     1.0       no
7    cat  NaN     1.0      yes
8    dog  7.0     2.0       no
9    dog  3.0     1.0       no
  animal  age  visits priority
0    cat  2.5     1.0       no
1    cat  3.0     3.0       no
3    dog  NaN     3.0       no
7    cat  NaN     1.0       no
2  snake  0.5     2.0      yes
4    dog  5.0     2.0      yes
5    cat  1.5     3.0      yes
6  snake  4.5     1.0      yes
8    dog  7.0     2.0      yes
9    dog  3.0     1.0      yes

#### 16. В столбце «animal» измените записи «snake» на «python».

In [125]:
df.replace('snake','python')

   animal  age  visits priority
0     cat  2.5     1.0      yes
1     cat  3.0     3.0      yes
2  python  0.5     2.0       no
3     dog  NaN     3.0      yes
4     dog  5.0     2.0       no
5     cat  1.5     3.0       no
6  python  4.5     1.0       no
7     cat  NaN     1.0      yes
8     dog  7.0     2.0       no
9     dog  3.0     1.0       no

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [5]:
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df = df.drop_duplicates('A')
print(df)

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [153]:
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = list('abcdefghij'))
print(df)
maxSum = 0
maxNumber = 0
char = 'a'
for char in ['j']:
    if maxSum < df[char].sum():
        maxSum = df[char].sum()
        maxNumber = char
print(char)

          a         b         c         d         e         f         g  \
0  0.368365  0.480055  0.592254  0.409894  0.166683  0.607490  0.389143
1  0.839860  0.547571  0.116373  0.164248  0.764437  0.049792  0.813933
2  0.110790  0.123460  0.109756  0.358126  0.283721  0.086790  0.724519
3  0.787642  0.629888  0.118659  0.528949  0.408016  0.167553  0.737603
4  0.294314  0.585450  0.612144  0.450451  0.409050  0.664492  0.606450

          h         i         j
0  0.386300  0.636776  0.308201
1  0.785524  0.439622  0.641683
2  0.826067  0.271269  0.868533
3  0.502222  0.592045  0.228822
4  0.398984  0.391334  0.939237
5
(5, 10)
2.400970828009184
j

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [157]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
print(df)
x=df['value'].sum()/len(df)
df=df.fillna(x)
print(df)

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    2.5
4      a    2.0
5      b    3.0
6      b    2.5
7      b    1.0
8      a    7.0
9      b    3.0
10     a    2.5
11     b    8.0

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [185]:
df= pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                                '12. Air France', '"Swiss Air"']})
arr = df['From_To'].str.split('_')
for number in range(5):
    df.at[number, 'From'] = arr[number][0]
    df.at[number, 'To'] = arr[number][1]
print(df)

            From_To  FlightNumber  RecentDelays              Airline  \
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn